test/fixtures/vcr_cassettes/bill/pay.yml

---
http_interactions:
- request:
    method: post
    uri: http://api.regalii.dev/bill/pay
    body:
      encoding: UTF-8
      string: '{"id":229,"amount":758.0,"currency":"RD","user_id":3101}'
    headers:
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
      Accept:
      - application/vnd.regalii.v2.0+json
      User-Agent:
      - RegaliiCli gem v2.0.0
      Content-Type:
      - application/json
      Date:
      - Thu, 14 Jan 2016 22:23:06 GMT
      Content-Md5:
      - TTs06vATU+524bRgY1/V+w==
      Authorization:
      - APIAuth api-key:C4/HoTZ/86P9SFUBmavBb6x9BI4=
  response:
    status:
      code: 201
      message: Created
    headers:
      X-Frame-Options:
      - SAMEORIGIN
      X-Xss-Protection:
      - 1; mode=block
      X-Content-Type-Options:
      - nosniff
      Content-Type:
      - application/json; charset=utf-8
      Etag:
      - '"28211ccb27107ca4518c415bf72e1ac1"'
      Cache-Control:
      - max-age=0, private, must-revalidate
      X-Request-Id:
      - 5796c160-3ee8-46da-acb6-ca66fced9da9
      X-Runtime:
      - '0.364466'
      Vary:
      - Origin
      Date:
      - Thu, 14 Jan 2016 22:23:10 GMT
      Connection:
      - close
    body:
      encoding: UTF-8
      string: '{"id":20,"external_id":null,"biller_id":2,"account_number":"8081969","bill_amount":758.0,"bill_amount_currency":"RD","fx_rate":41.8686,"bill_amount_usd":18.1,"bill_amount_chain_currency":18.1,"payment_transaction_fee":3.0,"payment_total_usd":21.1,"payment_total_chain_currency":21.1,"chain_earned":0.0,"chain_paid":21.1,"starting_balance":-134.64,"ending_balance":-155.74,"hours_to_fulfill":0,"discount":0.0,"sms_text":"Tu
        pago de Edenorte por $758.00RD se realizo con éxito! Ahora también puedes
        pagar tu factura de Edesur, Viva y Claro en tu tienda Regalii.","created_at":"2016-01-14T22:23:10Z","payment_status":"sent"}'
    http_version: 
  recorded_at: Thu, 14 Jan 2016 22:23:10 GMT
recorded_with: VCR 2.9.3
