test/fixtures/vcr_cassettes/v30/bill/pay.yml

---
http_interactions:
- request:
    method: post
    uri: http://api.regalii.dev/bills/5/pay
    body:
      encoding: UTF-8
      string: '{"amount":758.0,"currency":"RD"}'
    headers:
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
      Accept:
      - application/vnd.regalii.v3.0+json
      User-Agent:
      - Regaliator gem v3.0.0
      Content-Type:
      - application/json
      Date:
      - Tue, 22 Mar 2016 21:42:57 GMT
      Content-Md5:
      - u+ZqIKO1puNX1Bmnc+RIeA==
      Authorization:
      - APIAuth api-key:DSMavaId21EfyfSnPEheCztLWzo=
  response:
    status:
      code: 201
      message: Created
    headers:
      X-Frame-Options:
      - SAMEORIGIN
      X-Xss-Protection:
      - 1; mode=block
      X-Content-Type-Options:
      - nosniff
      Content-Type:
      - application/json; charset=utf-8
      Etag:
      - '"23ca92e46ced650653468a75c275d4be"'
      Cache-Control:
      - max-age=0, private, must-revalidate
      X-Request-Id:
      - 0ceec74f-d2d1-4881-b794-bf486011f5c4
      X-Runtime:
      - '0.148770'
      Vary:
      - Origin
      Date:
      - Tue, 22 Mar 2016 21:42:58 GMT
      Connection:
      - close
    body:
      encoding: UTF-8
      string: '{"id":23,"external_id":null,"biller_id":2,"account_number":"8081969","bill_amount":758.0,"bill_amount_currency":"RD","fx_rate":43.7165,"bill_amount_usd":17.34,"bill_amount_chain_currency":17.34,"payment_transaction_fee":3.0,"payment_total_usd":20.34,"payment_total_chain_currency":20.34,"chain_earned":0.0,"chain_paid":20.34,"starting_balance":-101.2,"ending_balance":-121.54,"hours_to_fulfill":0,"discount":0.0,"sms_text":null,"created_at":"2016-03-22T21:42:57Z","payment_status":"sent","bill_amount_local_currency":758.0,"local_currency":"RD"}'
    http_version:
  recorded_at: Tue, 22 Mar 2016 21:42:58 GMT
recorded_with: VCR 2.9.3
